app/Filament/Resources/DriverResource.php

select `name`, `code` from `provinces`
---
    public static function form(Form $form): Form
    {
        return $form
            ->schema([
                Forms\Components\TextInput::make('first_name')
                    ->required()
                    ->maxLength(255),
                Forms\Components\TextInput::make('last_name')
                    ->required()
                    ->maxLength(255),
                Forms\Components\TextInput::make('phone_number')
                    ->required()
                    ->maxLength(255),
                Forms\Components\Select::make('gender')
                    ->required()
                    ->options([
                        'male' => 'Male',
                        'female' => 'Female',
                    ])
                    ->default('male'),
                Forms\Components\TextInput::make('identity_card_number')
                    ->required()
                    ->numeric(),
                Forms\Components\TextInput::make('licence_plate')
                    ->required()
                    ->numeric(),
                Forms\Components\Select::make('province_id')->label('Province')
                    ->required()
                    ->options(Province::pluck('name', 'code')),

select `name`, `code` from `provinces`
---
    public static function table(Table $table): Table
    {
        return $table
            ->columns([
                TextColumn::make('id')->searchable()->sortable(),
                TextColumn::make('s_id')->searchable()->sortable(),
                TextColumn::make('first_name')->searchable()->sortable(),
                TextColumn::make('last_name')->searchable()->sortable(),
                TextColumn::make('phone_number')->searchable()->sortable(),
                TextColumn::make('gender')->searchable()->sortable(),
                TextColumn::make('identity_card_number')->searchable()->sortable(),
                TextColumn::make('licence_plate')->searchable()->sortable(),
                ViewPhoto::make('photo'),
                TextColumn::make('email')->searchable()->sortable(),
                TextColumn::make('reported_count')->searchable()->sortable(),
                TextColumn::make('vehicle_type')->searchable()->sortable(),
                TextColumn::make('commercial_register_number')->searchable()->sortable(),
                TextColumn::make('capacity')->searchable()->sortable(),
                TextColumn::make('can_transport_goods'),
                AccountStatusColumn::make('account_status'),
            ])
            ->filters([
                Tables\Filters\TrashedFilter::make(),
                SelectFilter::make('account_status')
                    ->options([
                        'pending' => 'Pending',
                        'suspended' => 'Suspended',
                        'active' => 'Active',
                    ]),
                SelectFilter::make('province_id')->label('Province')
                    ->options(Province::pluck('name', 'code'))